#导入包-------------------------------------------------------------
import pandas as pd
import numpy as np
from IPython.display import display
import warnings
warnings.filterwarnings("ignore")

ym = '2022.06'
path = "D:\\1.office_syx\\不良\\2022.06不良月报\\"

#1.读取文件--------------------------------------------------------------------------------------------------------------
# xlsx转为csv
bs = pd.read_excel(path + ym + '不良明细.xlsx')
br = pd.read_excel(path + ym + '不良率.xlsx')
jj = pd.read_excel(path+ym +'降级入库.xlsx')
th = pd.read_excel(path+ym +'退货明细.xlsx')

#2.数据处理--------------------------------------------------------------------------------------------------------------
#不良率数据处理
br =br[['供应商','年度','月份','采购订单分类','总订单量', '实际总不良件数','实际总不良率','实际工艺不良件数','实际工艺不良率', '实际错漏件数','实际错漏率']]  #保留需要的列
br = br[br['供应商'].isin([100105,100118,100120,100122,100140,100141,103195,103233,103275,103407,103695,103730,104657,104661,104738,104656,105042,105041,105078,105171,105630,105730,105929])]

#不良明细数据处理
bs_gys = bs[bs['责任归属'].isin(['供应商责任'])]   #筛出供应商责任

#降级入库数据处理
jj = jj.loc[~jj['费用'].isin([0.00])]     #删除费用为0的数据
df_data = pd.concat([jj['采购凭证'],jj['定制编码'],jj['供应商'],jj['款号'],jj['款式名称'],jj['批次'],jj['质检结果'],jj['不合格原因描述'],jj['责任归属'],jj['质检地址描述'],jj['送检日期'],jj['圈口'],jj['质检人']], axis=1)   #选取需要用到的列

df_data = df_data.reset_index(drop=True)
df_data.columns = ['采购订单','定制编码','供应商','款号','款式名称','批次','质检结果','不合格原因','责任归属','质检地点','退回日期','订单类型描述','质检人']   #重新设置列索引

#退货明细数据处理
df_datath = pd.concat([th['采购订单'],th['收货标识'],th['供应商'],th['收货标识'],th['物料描述'],th['批次'],th['移动类型文本'],th['收货标识'],th['收货标识'],th['收货标识'],th['输入日期'],th['收货标识'],th['用户名']], axis=1)
df_datath = df_datath.reset_index(drop=True)
df_datath.columns = ['采购订单','定制编码','供应商','款号','款式名称','批次','质检结果','不合格原因','责任归属','质检地点','退回日期','订单类型描述','质检人']   #重新设置列索引

#明细数据拼接
df_pin = pd.concat([bs_gys,df_data,df_datath])   #拼接不良明细和降级入库
#筛选出错漏
bs_cuolou = df_pin[df_pin['不合格原因'].isin(['漏刻字','刻字错','石重低配','镶错石','款式错','材质错','手寸错','成色不足','石重高配','单反石','调乱货','链不符','版型不符','货重不符','来货信息不符','款式错','材质错','链不符','货重不符'])]

br.to_excel(path + ym + '不良率.xlsx',index=False)
with pd.ExcelWriter(path+ym+"不良明细终.xlsx") as writer:  # 写出到每日汇报的表格
    df_pin.to_excel(writer, sheet_name='不良明细总表', index=False)
    bs_cuolou.to_excel(writer, sheet_name='错漏明细', index=False)